sorosaulong-ux/gd32-test-project/Library/gd32a7xx_mcmu.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_MCMU_PERIPH(mcmu_periph)) {
        fw_debug_report_err(MCMU_MODULE_ID, API_ID(0x000AU), ERR_PERIPH);
    } else if(NOT_MCMU_GET_FLAG(flag)) {
        fw_debug_report_err(MCMU_MODULE_ID, API_ID(0x000AU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(0U != (MCMU_REG_VAL(mcmu_periph, flag) & BIT(MCMU_BIT_POS(flag)))) {
            reval = SET;
        } else {
            reval = RESET;
        }
    }
    return reval;
}

/*!
    \brief      mcmu flag clear (API_ID: 0x000BU)
    \param[in]  mcmu_periph : MCMUA or MCMUB
    \param[in]  flag : mcmu flags type
                only one parameter can be selected which is shown as below:
      \arg        MCMU_FLAG_RSTIF   : MCMU reset interrupt flag
      \arg        MCMU_FLAG_NIF0    : normal interrupt flag from the other MCMU
    \param[out] none
    \retval     none
*/
void mcmu_flag_clear(uint32_t mcmu_periph, mcmu_flag_enum flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_MCMU_PERIPH(mcmu_periph)) {
        fw_debug_report_err(MCMU_MODULE_ID, API_ID(0x000BU), ERR_PERIPH);
    } else if(NOT_MCMU_CLEAR_FLAG(flag)) {
        fw_debug_report_err(MCMU_MODULE_ID, API_ID(0x000BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* clear by write 1 */
        MCMU_REG_VAL(mcmu_periph, flag) = BIT(MCMU_BIT_POS(flag));
    }
}

/*!
    \brief      get mcmu interrupt flag status (API_ID: 0x000CU)
    \param[in]  mcmu_periph : MCMUA or MCMUB
    \param[in]  flag : mcmu flags
                only one parameter can be selected which is shown as below:
      \arg        MCMU_INT_FLAG_NIF0   : normal interrupt flag from the other MCMU
      \arg        MCMU_INT_FLAG_TEF0   : transmit data register 0 empty flag
      \arg        MCMU_INT_FLAG_TEF1   : transmit data register 1 empty flag
      \arg        MCMU_INT_FLAG_TEF2   : transmit data register 2 empty flag
      \arg        MCMU_INT_FLAG_TEF3   : transmit data register 3 empty flag
      \arg        MCMU_INT_FLAG_RNEF0  : receive data register 0 not empty flag
      \arg        MCMU_INT_FLAG_RNEF1  : receive data register 1 not empty flag
      \arg        MCMU_INT_FLAG_RNEF2  : receive data register 2 not empty flag
      \arg        MCMU_INT_FLAG_RNEF3  : receive data register 3 not empty flag
    \param[out] none
    \retval     FlagStatus : SET or RESET
*/
FlagStatus mcmu_interrupt_flag_get(uint32_t mcmu_periph, mcmu_interrupt_flag_enum int_flag)
{
    FlagStatus reval = RESET;
    uint32_t intenable;
    uint32_t flagstatus;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_MCMU_PERIPH(mcmu_periph)) {
        fw_debug_report_err(MCMU_MODULE_ID, API_ID(0x000CU), ERR_PERIPH);
    } else if(NOT_MCMU_INTERRUPT_GET_FLAG(int_flag)) {
        fw_debug_report_err(MCMU_MODULE_ID, API_ID(0x000CU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the interrupt enable bit status */
        intenable = (MCMU_REG_VAL2(mcmu_periph, int_flag) & BIT(MCMU_BIT_POS2(int_flag)));
        /* get the corresponding flag bit status */
        flagstatus = (MCMU_REG_VAL(mcmu_periph, int_flag) & BIT(MCMU_BIT_POS(int_flag)));

        if((flagstatus != 0U) && (intenable != 0U)) {
            reval = SET;
        } else {
            reval = RESET;
        }
    }
    return reval;
}

/*!
    \brief      clear mcmu interrupt flag (API_ID: 0x000DU)
    \param[in]  mcmu_periph : MCMUA or MCMUB
    \param[in]  flag : mcmu flags
                only one parameter can be selected which is shown as below:
      \arg        MCMU_INT_FLAG_NIF0    : normal interrupt flag from the other MCMU
    \param[out] none
    \retval     FlagStatus : SET or RESET
*/
void mcmu_interrupt_flag_clear(uint32_t mcmu_periph, mcmu_interrupt_flag_enum int_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_MCMU_PERIPH(mcmu_periph)) {
        fw_debug_report_err(MCMU_MODULE_ID, API_ID(0x000DU), ERR_PERIPH);
    } else if(NOT_MCMU_INTERRUPT_CLEAR_FLAG(int_flag)) {
        fw_debug_report_err(MCMU_MODULE_ID, API_ID(0x000DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* clear by write 1 */
        MCMU_REG_VAL(mcmu_periph, int_flag) = BIT(MCMU_BIT_POS(int_flag));
    }
}


/*!
    \brief      enable parity error report to FMU (API_ID: 0x000EU)
    \param[in]  mcmu_periph : MCMUA or MCMUB
    \param[in]  chy : receive channel, 0~3
    \param[out] none
    \retval     none
*/
void mcmu_parity_error_report_enable(uint32_t mcmu_periph, uint32_t chy)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_MCMU_PERIPH(mcmu_periph)) {
        fw_debug_report_err(MCMU_MODULE_ID, API_ID(0x000EU), ERR_PERIPH);
    } else if(NOT_MCMU_DATA_CHANNEL(chy)) {
        fw_debug_report_err(MCMU_MODULE_ID, API_ID(0x000EU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        MCMU_PERRFE(mcmu_periph) |= BIT(chy);
    }
}

/*!
    \brief      disable parity error report to FMU (API_ID: 0x000FU)
    \param[in]  mcmu_periph : MCMUA or MCMUB
    \param[in]  chy : receive channel, 0~3
    \param[out] none
    \retval     none
*/
void mcmu_parity_error_report_disable(uint32_t mcmu_periph, uint32_t chy)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_MCMU_PERIPH(mcmu_periph)) {
        fw_debug_report_err(MCMU_MODULE_ID, API_ID(0x000FU), ERR_PERIPH);
    } else if(NOT_MCMU_DATA_CHANNEL(chy)) {
        fw_debug_report_err(MCMU_MODULE_ID, API_ID(0x000FU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        MCMU_PERRFE(mcmu_periph) &= ~(BIT(chy));
    }
}

/*!
    \brief      parity error state get (API_ID: 0x0010U)
    \param[in]  mcmu_periph : MCMUA or MCMUB
    \param[in]  chy : receive channel, 0~3
    \param[out] none
    \retval     FlagStatus : SET or RESET
*/
FlagStatus mcmu_parity_error_get(uint32_t mcmu_periph, uint32_t chy)
{
    FlagStatus reval = RESET;

