sorosaulong-ux/gd32-test-project/Library/gd32a7xx_mcmu.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_MCMU_PERIPH(mcmu_periph)) {
        fw_debug_report_err(MCMU_MODULE_ID, API_ID(0x0010U), ERR_PERIPH);
    } else if(NOT_MCMU_DATA_CHANNEL(chy)) {
        fw_debug_report_err(MCMU_MODULE_ID, API_ID(0x0010U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(0U != (MCMU_PERRSTAT(mcmu_periph) & BIT(chy))) {
            reval = SET;
        } else {
            reval = RESET;
        }
    }
    return reval;
}

/*!
    \brief      parity error clear (API_ID: 0x0011U)
    \param[in]  mcmu_periph : MCMUA or MCMUB
    \param[in]  chy : receive channel, 0~3
    \param[out] none
    \retval     none
*/
void mcmu_parity_error_clear(uint32_t mcmu_periph, uint32_t chy)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_MCMU_PERIPH(mcmu_periph)) {
        fw_debug_report_err(MCMU_MODULE_ID, API_ID(0x0011U), ERR_PERIPH);
    } else if(NOT_MCMU_DATA_CHANNEL(chy)) {
        fw_debug_report_err(MCMU_MODULE_ID, API_ID(0x0011U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* clear by write 1 */
        MCMU_PERRSTAT(mcmu_periph) = BIT(chy);
    }
}

/*!
    \brief      tmr error report to FMU (API_ID: 0x0012U)
    \param[in]  mcmu_periph : MCMUA or MCMUB
    \param[in]  tmr : mcmu tmr fault
                one or more parameters can be selected which are shown as below:
      \arg        MCMU_TMR_ALARM_SCTL: TMR fault alarm of SCTL register to FMU
      \arg        MCMU_TMR_ALARM_NINT: TMR fault alarm of NINTEN and NINTCTL registers to FMU
      \arg        MCMU_TMR_ALARM_TINT: TMR fault alarm of TINTCTL register to FMU
      \arg        MCMU_TMR_ALARM_RINT: TMR fault alarm of RINTCTL register to FMU
    \param[out] none
    \retval     none
*/
void mcmu_tmr_error_report_enable(uint32_t mcmu_periph, uint32_t tmr)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_MCMU_PERIPH(mcmu_periph)) {
        fw_debug_report_err(MCMU_MODULE_ID, API_ID(0x0012U), ERR_PERIPH);
    } else if(NOT_MCMU_TMR_ALARM(tmr)) {
        fw_debug_report_err(MCMU_MODULE_ID, API_ID(0x0012U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* prevent the upper 16 bit being cleared by write 1 */
        MCMU_TMRFACS(mcmu_periph) = (MCMU_TMRFACS(mcmu_periph) & 0x0000FFFFUL) | tmr;
    }
}

/*!
    \brief      tmr error did not report to FMU (API_ID: 0x0013U)
    \param[in]  mcmu_periph : MCMUA or MCMUB
    \param[in]  tmr : mcmu tmr fault
                one or more parameters can be selected which are shown as below:
      \arg        MCMU_TMR_ALARM_SCTL: TMR fault alarm of SCTL register to FMU
      \arg        MCMU_TMR_ALARM_NINT: TMR fault alarm of NINTEN and NINTCTL registers to FMU
      \arg        MCMU_TMR_ALARM_TINT: TMR fault alarm of TINTCTL register to FMU
      \arg        MCMU_TMR_ALARM_RINT: TMR fault alarm of RINTCTL register to FMU
    \param[out] none
    \retval     none
*/
void mcmu_tmr_error_report_disable(uint32_t mcmu_periph, uint32_t tmr)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_MCMU_PERIPH(mcmu_periph)) {
        fw_debug_report_err(MCMU_MODULE_ID, API_ID(0x0013U), ERR_PERIPH);
    } else if(NOT_MCMU_TMR_ALARM(tmr)) {
        fw_debug_report_err(MCMU_MODULE_ID, API_ID(0x0013U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* prevent the upper 16 bit being cleared by write 1 */
        MCMU_TMRFACS(mcmu_periph) = (MCMU_TMRFACS(mcmu_periph) & 0x0000FFFFUL) & (~tmr);
    }
}

/*!
    \brief      tmr error flag get (API_ID: 0x0014U)
    \param[in]  mcmu_periph : MCMUA or MCMUB
    \param[in]  tmrflag : mcmu tmr flags
                only one parameter can be selected which are shown as below:
      \arg        MCMU_TMR_FLAG_SCTL: TMR fault alarm flag of SCTL register
      \arg        MCMU_TMR_FLAG_NINT: TMR fault alarm flag of NINTEN and NINTCTL registers
      \arg        MCMU_TMR_FLAG_TINT: TMR fault alarm flag of TINTCTL register
      \arg        MCMU_TMR_FLAG_RINT: TMR fault alarm flag of RINTCTL register
    \param[out] none
    \retval     FlagStatus : SET or RESET
*/
FlagStatus mcmu_tmr_error_get(uint32_t mcmu_periph, uint32_t tmr_flag)
{
    FlagStatus reval = RESET;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_MCMU_PERIPH(mcmu_periph)) {
        fw_debug_report_err(MCMU_MODULE_ID, API_ID(0x0014U), ERR_PERIPH);
    } else if(NOT_MCMU_TMR_FLAG(tmr_flag)) {
        fw_debug_report_err(MCMU_MODULE_ID, API_ID(0x0014U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(0U != (MCMU_TMRFACS(mcmu_periph) & tmr_flag)) {
            reval = SET;
        } else {
            reval = RESET;
        }
    }
    return reval;
}

/*!
    \brief      tmr error flag clear (API_ID: 0x0015U)
    \param[in]  mcmu_periph : MCMUA or MCMUB
    \param[in]  tmrflag : mcmu tmr flags
                one or more parameters can be selected which are shown as below:
      \arg        MCMU_TMR_FLAG_SCTL: TMR fault alarm flag of SCTL register
      \arg        MCMU_TMR_FLAG_NINT: TMR fault alarm flag of NINTEN and NINTCTL registers
      \arg        MCMU_TMR_FLAG_TINT: TMR fault alarm flag of TINTCTL register
      \arg        MCMU_TMR_FLAG_RINT: TMR fault alarm flag of RINTCTL register
    \param[out] none
    \retval     none
*/
void mcmu_tmr_error_clear(uint32_t mcmu_periph, uint32_t tmr_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_MCMU_PERIPH(mcmu_periph)) {
        fw_debug_report_err(MCMU_MODULE_ID, API_ID(0x0015U), ERR_PERIPH);
    } else if(NOT_MCMU_TMR_FLAG(tmr_flag)) {
        fw_debug_report_err(MCMU_MODULE_ID, API_ID(0x0015U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* prevent the upper 16 bit being cleared by write 1 */
        MCMU_TMRFACS(mcmu_periph) = (MCMU_TMRFACS(mcmu_periph) & 0x0000FFFFUL) | tmr_flag;
    }
}
#endif /* #if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
